// Задние 1
let sek1=24 * 60 * 60;
console.log("Количество секунд в сутках = " + sek1);


// Задние 2
let sek2 = 30 * 24 * 60 * 60;
console.log("Количество секунд в 30 сутках = " + sek2);



// Задние 3
let sek3 = 365 * 24 * 60 * 60;
console.log("Количество секунд в году = " + sek3);


// Задние 4
let min1 =  24 * 60;
console.log("Количество минут в сутках = " + min1);

// Задние 5
let min2 =  365 * 24 * 60;
console.log("Количество минут в году = " + min2);

// Задние 6
let bayt = 1024 * 1024;
console.log("Количество байт в мегабайте. = " + bayt);




// Задние 7
let bayt1 =(1024) ** 3;
console.log("Количество байт в гигабайте. = " + bayt1);

// Задние 8
let bayt2 =10 * (1024) ** 3;
console.log("Количество байт в 10 гигабайтах. = " + bayt2);

// Задние 9
let bayt3 = (1024) ** 4;
console.log("Количество байт в терабайте. = " + bayt3);


// Задние 10
let bayt4 = (1024) ** 3;
console.log("Количество килобайт в терабайте. = " + bayt4);
