// Задание 1
let a = '5' + '2';
alert(a); //52

// Задание 2
let b = '5' + 2;
alert(b); // 52

// Задание 3
let k = 5 + '2';
alert(k); //52

// Задание 4
let l = 5 + 2;
alert(l); // 7

// Задание 5
let m = '5' * '2';
alert(m); // 10

// Задание 6
let t = '5' - '2';
alert(t);// 3 

// Задание 7
let c = '5' / '2';
alert(c); // 3,5

// Задание 8
let d = '5' % '2';
alert(d); // 1

// Задание 9
let v = '5s' * '2';
alert(v);//NaN

// Задание 10
let q = '5s' + '2';
alert(q);// NaN

// Задание 11
let s = (-'5') + (-'2');
alert(s);// -7

// Задание 12
let y = '5' * 1 + '2' * 1;
alert(y);// 7

// Задание 13
let p = '5' * '1' + '2' * '1';
alert(p);// 7

// Задание 14
let f = '' + 3 + 1;
alert(f);// 31
